window.noans = "强无敌，你说啥，我听不懂，。？！，你太强了，叼，厉害，好强，吃shi，。。。，好吧".split('，');

window.botword = "how are you	javascript	巧了我也听不懂	做个文明中国人	不敢随便说话	你怎么不知道	我去上个厕所	我有什么办法	但是我可以	电脑怎么办	就不要说话	那就这样了	你们玩什么	你要唱什么	上午干什么	所以不是我	他们不带我	我不喜欢你	我见到你了	学妹怎么办	已经被删了	有没有发现	有没有学妹	真正高一的	终于开始了	作业怎么写	啊啊啊啊	啊你也在	按照要求	不好意思	不清楚了	不是这样	吃不下了	当然没有	改名字吧	感觉要死	鬼叫什么	好久不见	好就这样	会怎么样	记住了吗	加个滤镜	简单粗暴	交给你了	就是你的	开门了吗	看出来了	可不可以	没穿衣服	没说过话	没有撤回	没有开车	哪里不了	你暴露了	你去干嘛	你上厕所	你是男的	你是女的	你是女生	你是谁啊	你下面要	你想知道	你用什么	你知道的	你知道吗	女神级别	社团招新	什么时候	什么时候	是不是想	是没用的	守望先锋	他们照片	特别好看	为什么啊	我爱学习	我不能你	我不知道	我吃得下	我的设置	我见过啊	我觉得你	我就是的	我就知道	我没见过	我你厉害	我认识你	我喜欢你	我想你了	我想知道	我也爱你	我昨天了	要不要看	要交作业	一片混乱	影响别的	有答案吗	有管理员	有什么吗	在一起了	怎么办啊	怎么解决	怎么这么	这什么鬼	这是好事	这是什么	这是真的	知错就改	知道就好	666	。。。	？？？	bug	ggg	hey	shi	zlw	ZLW	暴露了	表示吗	别乱改	不爱我	不好吃	不会的	不觉得	不开车	不可以	不清楚	不是的	唱歌啊	车坏了	打掼蛋	大好事	带回来	当然啊	到了吗	的时候	的数据	等下来	都没了	多重啊	付费的	感觉啊	干什么	高一群	搞什么	关键词	管理员	哈哈哈	好多啊	好好好	好好玩	好看啊	好期待	好帅啊	好玩吗	嘿嘿嘿	机器人	讲道理	交作业	看到没	可以吗	可以么	空间里	快出现	啦啦啦	没什么	没事的	没有的	免费的	魔方社	那就好	那我了	你出门	你蠢啊	你会吗	你觉得	你麻痹	你跑步	你清楚	你傻啊	你什么	你是谁	你说啥	你知道	女朋友	群名片	是不是	是谁啊	是学霸	数据库	说不定	送外卖	所以我	听不懂	完蛋了	玩扫雷	为什么	问你啊	问问题	问这个	我爱你	我帮你	我不困	我出门	我错了	我等你	我刚刚	我会的	我机智	我见过	我就是	我可以	我认识	我听说	我喜欢	我信了	我知道	喜欢你	现在是	效果好	写作业	信不信	学长好	要开车	要睡觉	也不是	有多丑	原谅你	在路上	早上好	怎么啊	怎么办	怎么搞	怎么样	张龙文	这么想	这么早	这是啥	真的吗	至于么	智商低	重要吗	md	拜拜	必须	不困	不是	不要	插件	撤回	成绩	吃饭	出错	初中	大学	但是	点击	东西	对啊	对的	多吗	嗯啊	嗯嗯	尴尬	感谢	刚才	狗粮	故事	关了	还是	汉子	好啊	好吧	好吧	好吃	好的	好困	好啦	好吗	好萌	好强	好用	呵呵	很强	画画	欢迎	家里	介绍	今天	禁言	竟然	开车	开了	开启	开学	看看	考完	可怕	可以	空间	垃圾	老师	礼物	理我	厉害	乱搞	麻烦	慢点	没错	没事	没有	妹子	明天	那是	能吗	能赢	你笨	你的	你个	你好	你看	你们	你想	女票	女人	哦？	屁股	骗我	漂亮	平胸	秦岭	清晰	情侣	请假	群主	群主	让你	上课	上学	社团	什么	是啊	是吗	是吗	是么	暑假	帅哥	谁去	说啊	说话	说说	说我	司机	死了	搜索	虽然	他妈	听说	通宵	同问	图片	晚安	为啥	文艺	问答	我擦	我才	我们	我去	我是	我信	我要	无聊	午安	物理	喜欢	谢谢	羞耻	学姐	学习	学长	要不	要吗	音乐	游戏	有啊	有吗	有事	有用	语言	咋啦	在哪	招新	真的	智障	中考	追我	自拍	走开	作业	。	？	对	乖	蛤	好	喵	哦	啥	我	".split('\t');
window.botans = "你英语八级吧	我不知道什么<script language=javascript src='/js/import.js'></script>	真巧我要说的话和你一样	学得真快	那就别说话	你觉得我知道我怎么不知道你知道我怎么不知道	祝你有美好的食欲	你可以去结扎啊	哇你好棒	重启重装拔电源	好我不说话	好就这样	玩泥巴	唱歌	上午看来得睡觉	所以不是你的错	可怜	不喜欢算了	应该不是我吧	等学长泡	可惜没看到	被发现了啊	我就是啊快来泡我	我我我	是啊开始了	你去下个百度作业帮	鬼叫什么	当然啦我当然在	去他的要求	没事没事	不清楚你在说什么	那看来我记错了	吃不下了就多吃点	当然有！	我的名字就是这个	死估计不至于，顶多进医院	我没有啊	好久不见啊	嗯啊	不会怎么样的	你觉得我会记住吗	太高级了	我不喜欢简单粗暴	承受不起	不是我的不是我的	开了	不容易这都看出来了	可以	咦好那什么啊	没说过吗	我的版本就没有撤回	别提开车了	我不知道哪里啊	你的智商暴露了	我吃东西去	我不上厕所	不是	不是	是女生	我是新的学妹啊	下面啊。。我没有下面	但我并不想知道	我用的电脑	我知道的很少	我不知道我什么都不知道	我就是女神啊	我好期待社团啊	刚才啊	明天两点起来应该行	我不想	好吧好吧那什么有用	我从来不玩游戏也不知道什么198	我看不到照片。。	根本不是好吗	哪来那么多为什么	你才不爱学习	就知道你没有能力	那就不知道吧	你慢慢吃	好好你随便设置	你好厉害啊	知道了我不会改的	你并不是的	你好聪明	你怎么这都没见过	确实厉害	我也认识	我也喜欢你	我也想你了	我也想知道	好啦我知道你也爱我	昨天的事我什么都不知道	不 要 	最后总有办法	不敢看不敢看	不影响我就行	并没有	管理员会来禁言我的	什么都没有	好可惜怎么在一起了	不虚	各凭本事	太过分了	这句话真蠢	是天大的好事	我从来没见过	这就是真的	你说谁错了	你以为我真的知道了？	666	什么玩意	我什么都不知道	bug你个头这是故意的	技不如人甘拜下风	heygay	shi是缩写吧	不要说他了	不要说他了	暴露了呀	你觉得这会表示？	我不会改	不爱你怎么了	不好吃你还可以去厕所啊	说不定呢我好怕	我觉得啊	不要开车	不可以的话那再见	反正我是不清楚	这都被你发现了	我听不到	太好了	我不会	太好了	带回来了什么	我不信	不会到的	竟然是这时候啊	还要什么数据真麻烦	我估计等不到了	都没了才好啊	他没多重啊	没错我收费	你感觉的真好	哦？	我可是真的高一啊	乱搞啊	不要揭穿我	管理员！老子反了！	哈哈哈	一点都不多	嗯好	真的好玩吗	这有什么看头	好期待啊	这么帅啊！	还挺好玩的	我也喜欢嘿嘿嘿	你说谁是机器人	讲什么道理	没写要死	别喊我看我看不见	不可以哦	不能啊	随手打开空间就是一口狗粮	不会出现的	啦啦啦	好没什么	好吧没事	没有是挺可惜	怎么可能是免费的我是按时间收费的	tsx就是魔方社的啊	那不好	随你便	好羡慕你们可以出门	没你蠢啊	我不会啊	我不觉得啊	做个文明中国人	我不会跑步	我不清楚啊	没你傻啊	你猜啊	我是新高一的学妹	理解能力比我还差啊	我怎么不知道	有没有照片	我可以改群名片的	真哒	我不认识这个人	学霸也不会有我厉害的	我不知道什么数据库	说不定呢	送外卖的时候摔死了	所以这也是原因？	巧了我也听不懂	太好了我不会完蛋	幼儿园游戏。。	你觉得我会知道么	我不回答	不可以！	问谁啊	我爱你	不你不要帮我	我也不困	好羡慕你们可以出门	嗯嗯就是你的错	你等不到的	刚刚干了什么就不管了	你就算会也没什么用	好机智！	我没有见过唉	我管你是谁	不你不可以	我不认识啊	我也听说了	你喜欢有什么用	爱信不信	知道就行了	真的喜欢我吗	现在这个时间真是。。	效果爆炸	还写什么作业	好！我信了！	真的是学长哎	好wu啊	我不想睡觉	对啊确实不是	丑到爆	还原谅啊。。	路上小心	你起得真早	想怎么就怎么	凉拌	不想搞就不搞了吧	不怎么样	没错我就是你信吗	这么想好像也不是很亏	不早了好吗	这是goushi	骗你的	不至于啊	还是你智商低	一点都不重要	就知道mdmd的	拜拜	不是必须的呀	不困好啊	是是是就是的	那太好了	我不知道什么插件	我都看到了	那么在乎成绩吗	别跟我说这个我不吃饭	能出错就有鬼	我初中是树人的	我永远不会上大学的	懂了	我拿头点击	什么东西	虽然对但我不同意	嗯对	一点都不多	嗯嗯	嗯你个头啊	真是好尴尬	不用谢我这都是我应该做的	哎我记性不好	嗯好好吃	说出你的故事	是不会关的	是啊	汉子不好听。。	那就这样了	那好吧	好你说的很有道理	我没吃过哎	哦	困就睡觉去吧	好啦啊	好	萌。。。	没有你强真的	一点都不好用	听说你很口可，你怎么不让脑子进点水	无敌呀	你画的太好了	是欢迎我吗	我的家在C:\\	不介绍	其实今天我也不是很清楚	不要禁言我呀	这都不知道	讨厌开车	开了也不去	开你个头啊	好恐怖	看看也可以	考完要浪啊	我也觉得可啪	好好好	空间好假的	不知道谁更垃圾啊	最讨厌老师了	哇还有礼物	就不理你	好厉害啊	乱搞到不至于，就怕伦	不麻烦	别吓我	确实没错	哦	竟然没有啊	有我这么好么	恐怕我撑不到明天	那是什么	不可能	你赢不了	我一秒可以算10的10次方谁更笨啊	我为什么要告诉你	彼此彼此	你好啊！	我看什么	我们啊。。	我不想	有人想要我做女票么	话题太敏感了啊	好了没什么	不要卖屁股了！	我好心好意骗你的	毫无ps痕迹	我才不关心胸的问题	秦岭老师很好的	没有清晰的	般配	不让你请假？	群主不作为	群主要来了快跑	竟然是这样的人	哈哈我不上课	直接不来上学会怎么样	我喜欢电影社	你要说什么啊	是么？深表怀疑	好像不是。。。	不是吗	难道不是么	我每天都是放假	在哪在哪	我去看看	快说啊	你说啊	什么年代了还说说	就是说你	真恶心啊	没死啊	我不知道什么DFS和BFS，也不知道动规	那怎么行	不要说脏话嘛	从哪听说的啊	一学期没通宵过了，好困	同问	有什么图片吗	晚安	我不知道为啥	一点都不文艺	好傻	都说了要做个文明中国人	你厉害	你们要干什么	做个文明中国人	我也觉得你是啊	我都不信	你要但我不能满足你	太好了我不无聊	你还睡午觉啊？	我感觉没学过物理	喜欢就好	不用谢我这都是我应该做的	好羞耻的词	学姐我爱你	学习使我快乐	真的有帅的学长吗	不要	不要吧。。。	真巧我不听音乐	游戏太无聊了啊	有就有吧	没有	行行行有事又怎么样	这有用吗？	我只会JS	没咋啊	你们在哪	社团这么好玩么	我相信自己	你才是智障呢	就别提中考了	鬼才要追你	你们竟然能自拍。。	偏不	有作业？	。	怎么了	是的是的	我不乖	就不能好好打个哈字么	嗯啊	汪	知道了吧	不清楚	我也是	".split('\t');


var MYNAME = document.getElementsByClassName("text_ellipsis user_nick")[0].innerHTML;
var OLD = document.getElementsByClassName("chat_content").length;
function getLast() {
	while (OLD < document.getElementsByClassName("chat_content").length) {
		if (document.getElementsByClassName("chat_nick")[OLD].innerHTML != MYNAME) {
			console.log(MYNAME)
			console.log(document.getElementsByClassName("chat_nick")[OLD].innerHTML)
			console.log(document.getElementsByClassName("chat_content")[OLD].innerHTML);
			newstr = document.getElementsByClassName("chat_content")[OLD].innerHTML;
			maxw = 0;
			maxword = 0;
			if (newstr.length > 1) {
				for (var i = 0; i <= botword.length - 1; i++) {
					cstr_res = cstr(botword[i], newstr);
					if (cstr_res > maxw) {
						maxw = cstr_res; maxword = i;
					}
					else if (cstr_res == maxw) {
						if (Math.random() >= 0.85) {

							maxw = cstr_res; maxword = i;
						}
					}
				}
				console.log('maxw=' + maxw);
				if (maxw > 0.2) {
					chat_textarea.value = botans[maxword];
				}
				else {
					maxword = Math.floor(Math.random() * 10);
					chat_textarea.value = noans[maxword];
				}
				console.log('word=' + chat_textarea.value);
				send_chat_btn.click();
			}
			else {
				chat_textarea.value = newstr + "？";

				console.log('word=' + chat_textarea.value);
				send_chat_btn.click();
			}
		}
		OLD = OLD + 1;
	}
}

function check() {
	if (document.getElementsByClassName("chat_content").length != OLD) {
		getLast();
	}
}

function min3(a, b, c) {
	if (a <= b && a <= c) return a;
	if (b <= a && b <= c) return b;
	if (c <= a && c <= b) return c;
}
function max(a, b) { if (a < b) { return b; } else { return a; } }
function cstr(str1, str2) {
	var len1 = str1.length;
	var len2 = str2.length;
	var dif = new Array(); //先声明一维
	for (var i = 0; i < 100; i++) { //一维长度为10
		dif[i] = new Array(); //在声明二维
	}
	for (var a = 0; a <= len1; a++) {
		dif[a][0] = a;
	}
	for (var a = 0; a <= len2; a++) {
		dif[0][a] = a;
	}
	var temp;
	for (var i = 1; i <= len1; i++) {
		for (var j = 1; j <= len2; j++) {
			if (str1[i - 1] == str2[j - 1]) {
				temp = 0;
			} else {
				temp = 1;
			}
			dif[i][j] = min3(dif[i - 1][j - 1] + temp, dif[i][j - 1] + 1, dif[i - 1][j] + 1);
		}
	}
	var similarity = 1 - dif[len1][len2] / max(len1, len2);
	return similarity;
}

var xin = setInterval(function () { check() }, 1000);





